CSI API ETABS v1

# cDesignSteelAISC_LRFD93 Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDStAISC_LRFD93 AISC_LRFD93 { get; }

    ReadOnly Property AISC_LRFD93 As cDStAISC_LRFD93
    	Get

    Dim instance As cDesignSteel
    Dim value As cDStAISC_LRFD93

    value = instance.AISC_LRFD93

    property cDStAISC_LRFD93^ AISC_LRFD93 {
    	cDStAISC_LRFD93^ get ();
    }

    abstract AISC_LRFD93 : cDStAISC_LRFD93 with get

#### Property Value

Type: cDStAISC_LRFD93

See Also

#### Reference

cDesignSteel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com